Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/starting_work_and_changing_job/training_and_looking_for_work/employment_life_event.html.txt.tmx
Source language: en
Languages: ga

source: Employment: you and your job
ga: Fostaíocht: tusa agus do phost

source: Getting your first job or moving from one job to another, as well as losing your job, are major events in your life
ga: Is eachtraí móra iad i do shaol do chéad phost a fháil, nó bheith ag bogadh ó phost go post, chomh maith le post a chailleadh

source: At such times, you may need information to help guide you through the process and to help you make the right choices
ga: Ag tréimhsí mar sin, d’fhéadfadh eolas a bheith uait chun tú a threorú tríd an bpróiseas agus chun cúnamh a thabhairt duit na roghanna cearta a dhéanamh

source: Whether you are a jobseeker looking for employment, changing jobs, facing redundancy or simply want to know more about your rights, there is a wide range of information relating to employment
ga: Is cuma má tá tú ag aimsiú poist, ag athrú poist, ag tabhairt aghaidh ar iomarcaíocht, nó má theastaíonn faisnéis uait faoi do chearta, tá réimse leathan faisnéise a bhaineann le fostaíocht

source: The Department of Social Protection offers a range of employment services to jobseekers
ga: Soláthraíonn an Roinn Coimirce Sóisialaí raon seirbhísí fostaíochta do chuardaitheoirí poist

source: Your rights as an employee are protected by employment law
ga: Tá do chearta mar fhostaí faoi chosaint ag an dhlí fostaíochta

source: You need to know about your employment rights and conditions and the procedure for enforcing your employment rights
ga: Ba cheart duit faisnéis a fháil faoi do chearta agus coinníollacha oibre agus faoi do chearta a chur i bhfeidhm

source: Specific legislation exists to protect your human rights and ensure equality at work
ga: Tá reachtaíocht ar leith ann chun do chearta daonna a chosaint agus chun comhionannas sa láthair oibre a chinntiú

source: You can find out about your rights if you believe you are being bullied, harassed or victimised
ga: Is féidir tuilleadh faisnéise a fháil faoi do cheart i gcás bulaíocht, ciapadh agus íospairt

source: If you are starting work
ga: Má tá tú ag tosú ar an obair

source: You need to do certain things before you start work
ga: Is gá duit nithe áirithe a dhéanamh sula dtosóidh tú ag obair

source: For example, if you are registered as unemployed you must contact your Intreo centre or social welfare local office and sign off when you start work
ga: Mar shampla, má tá tú cláraithe mar dhuine dífhostaithe, ní mór duit teagmháil a dhéanamh le hionad Intreo nó leis an oifig áitiúil leasa shóisialaigh agus síniú as an dól nuair a thosaíonn tú ag obair

source: When you start work you need to know about your Personal Public Service Number, contracts of employment, social insurance, the Universal Social Charge and tax when starting work
ga: Is féidir faisnéis a d’fhéadfadh a bheith úsáideach duit nuair a thosaíonn tú ag obair a aimsiú in Uimhir Phearsanta Sheirbhíse Poiblí, conarthaí fostaíochta, árachas sóisialta, an Muirear Sóisialta Uilíoch agus cáin agus obair a thosú

source: There is employment legislation to protect young people at work
ga: Tá dlithe fostaíochta chun dhaoine óga i bhfostaíocht a chosaint

source: You should find out about the minimum rate of pay, what information is in your pay slip and how your tax is calculated
ga: Ba cheart duit faisnéis faoin íosráta pá, cén eolas atá i do dhuillín pá, agus cén chaoi a ríomhtar do cháin a fháil

source: There are supports for low income earners and you need to know about pensions
ga: Tá tuilleadh faisnéise faoi tacaíocht do dhaoine ar ioncam íseal agus ba cheart duit a thuiscint maidir le pinsin

source: If you are changing, or thinking of changing, jobs, you should find out about giving notice when changing your job and income tax and social insurance records
ga: Má tá tú ag athrú poist nó má tá sé ar intinn agat é sin a dhéanamh, gheobhaidh tú an t-eolas a theastaíonn uait in Fógra a thabhairt nuair a athraíonn tú do phost agus in Athrú poist: cáin ioncaim agus taifid árachas sóisialta

source: Find the information you need if you are returning to work
ga: Tá tuilleadh eolais má tá tú ag filleadh ar an obair

source: There are various employment supports in Ireland aimed at assisting employees with a disability to gain and retain employment
ga: Tá réimse tacaíochtaí fostaíochta ar fáil in Éirinn chun cabhrú le fostaithe le míchumas post a fháil agus a choinneáil

source: Support is also available for employers to raise awareness of disability issues and to assist with retaining disabled employees
ga: Tá tacaíocht ar fáil d’fhostóirí chomh maith feasacht faoi cheisteanna a bhaineann le míchumas a mhúscailt agus chun cabhrú leo fostaithe le míchumas a choinneáil

source: The Department of Social Protection’s Reasonable Accommodation Fund provides supports such as the Personal Reader Grant, the Job Interview Interpreter Grant and grants for adapting the workplace for employees with disabilities
ga: Soláthraíonn an Ciste Freastal Réasúnta na Roinne Coimirce Sóisialaí tacaíochtaí, mar shampla, Deontas Léitheora Phearsanta, Deontas um Ateangaire ag Agallamh Poist agus deontais chun an láthair oibre a dhéanamh oiriúnach d’fhostaithe le míchumas

source: Losing your job, or finding out that you are facing redundancy can be a very difficult time for employees and their families
ga: D’fhéadfadh sé a bheith ina tréimhse fíordheacair d’fhostaí agus dá t(h)eaghlach má chailltear post, nó má táthar ag tabhairt aghaidh ar iomarcaíocht

source: You need to know what your employer should give you when you lose your job (for example, your P45) and what constitutes unfair dismissal. You may be entitled to redundancy
ga: Is féidir tuilleadh faisnéise a fháil faoi do cheart i gcás cad ba chóir do d’fhostóir thabhairt duit tar éis do phost a chailliúint agus céard is briseadh éagórach ann

source: You should contact your local Intreo centre or social welfare office for information about Jobseeker's Benefit and Jobseeker's Allowance
ga: Ba chóir duit teagmháil a dhéanamh le d’ionad Intreo nó d'oifig leasa shóisialaigh chun faisnéis maidir le Sochar Cuardaitheora Poist nó Liúntas Cuardaitheora Poist

source: If you have been unemployed for some time, you may be eligible for an employment scheme
ga: Má tá tú dífhostaithe fada go leor, d’fhéadfadh go mbeifeá i dteideal scéim fostaíochta

source: Coming to Ireland to work
ga: Ag teacht go hÉirinn le haghaidh fostaíochta

source: If you are coming or thinking of coming to Ireland to work, you can find useful information about coming from the EU to work, General Employment Permits and Critical Skills Permits
ga: Má tá tú ag teacht go hÉirinn chun post a fháil nó má tá sé ar intinn agat é sin a dhéanamh, is féidir eolas úsáideach a fháil in ag teacht ón AE, Cead Fostaíochta Ginearálta agus Cead Fostiaíochta Scileanna Criticiúla

source: If you are moving or thinking of moving abroad to work, you will find the information you need about working in the EU and working outside the EU
ga: Má tá tú ag bogadh thar lear le haghaidh fostaíochta nó má tá sé ar intinn agat é sin a dhéanamh, gheobhaidh tú an t-eolas a theastaíonn uait in ag obair san AE agus ag obair lasmuigh den AE
